{"class_name": "Model", "config": {"name": "model_31", "layers": [{"name": "input_31", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_31"}, "inbound_nodes": []}, {"name": "flatten_31", "class_name": "Flatten", "config": {"name": "flatten_31", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_31", 0, 0, {}]]]}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_31", 0, 0, {}]]]}, {"name": "dense_98", "class_name": "Dense", "config": {"name": "dense_98", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_97", 0, 0, {}]]]}, {"name": "dense_99", "class_name": "Dense", "config": {"name": "dense_99", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_98", 0, 0, {}]]]}], "input_layers": [["input_31", 0, 0]], "output_layers": [["dense_99", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}