{"class_name": "Model", "config": {"name": "model_35", "layers": [{"name": "input_35", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_35"}, "inbound_nodes": []}, {"name": "flatten_35", "class_name": "Flatten", "config": {"name": "flatten_35", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "dense_112", "class_name": "Dense", "config": {"name": "dense_112", "trainable": true, "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_35", 0, 0, {}]]]}, {"name": "dense_113", "class_name": "Dense", "config": {"name": "dense_113", "trainable": true, "units": 230, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_112", 0, 0, {}]]]}, {"name": "dense_114", "class_name": "Dense", "config": {"name": "dense_114", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_113", 0, 0, {}]]]}, {"name": "dense_115", "class_name": "Dense", "config": {"name": "dense_115", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_114", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0]], "output_layers": [["dense_115", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}