{"class_name": "Model", "config": {"name": "model_39", "layers": [{"name": "input_39", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_39"}, "inbound_nodes": []}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["input_39", 0, 0, {}]]]}, {"name": "dense_128", "class_name": "Dense", "config": {"name": "dense_128", "trainable": true, "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_39", 0, 0, {}]]]}, {"name": "dense_129", "class_name": "Dense", "config": {"name": "dense_129", "trainable": true, "units": 230, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_128", 0, 0, {}]]]}, {"name": "dense_130", "class_name": "Dense", "config": {"name": "dense_130", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_129", 0, 0, {}]]]}, {"name": "dense_131", "class_name": "Dense", "config": {"name": "dense_131", "trainable": true, "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_130", 0, 0, {}]]]}], "input_layers": [["input_39", 0, 0]], "output_layers": [["dense_131", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}